# AddBarGeometry Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarCurvesData..::..AddBarGeometry Method
RebarCurvesData Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddBarGeometry(IList<(Of <<'(Curve>)>>)) | Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| AddBarGeometry(CurveLoop) | Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |

# See Also
RebarCurvesData Class
RebarCurvesData Members
Autodesk.Revit.DB.Structure Namespace